import React from 'react';
import Header from "../components/common/Header/Header";

import Unimun from '../assets/svgs/unimun.svg'
import {useRouter} from "next/router";

const Rules = () => {

    const router = useRouter();
    return (
        <div className={'h-full overflow-scroll pb-20'}>

            <Header
                backOnClick={() => {
                    router.back();
                }}
                title={'قوانین و مقررات'}
                back={true}

            />


            <div className={'IranSansMedium text-textBlack px-4 pt-4 text-sm leading-6 text-justify '}>
                <h1 className={' text-xl mb-4 IranSansMedium text-center mx-4'}>
                    سیاست‌نامه حریم خصوصی

                </h1>


                <div className={'w-12 inline-block mx-1 h-2'}>
                    <Unimun/>
                </div>
                به حریم خصوصی کاربران خود احترام می‌گذارد و متعهد به حفاظت از اطلاعات شخصی است که شما در اختیار آن
                می‌گذارید.


                از آنجا که جمع‌آوری و پردازش اطلاعات شخصی بخش غیرقابل اجتنابی در فرآیندهای مبتنی بر تلفن
                همراه و اینترنت است لذا به منظور آگاهی کامل از سیاست و عملکرد
                <div className={'w-12 inline-block mx-1 h-2'}>
                    <Unimun/>
                </div>
                در این زمینه، مطالعه این سند تحت عنوان «سیاست‌نامه حریم خصوصی» و هر گونه پیام دیگری که در خصوص جمع‌آوری
                و پردازش اطلاعات توسط
                <div className={'w-12 inline-block mx-1 h-2'}>
                    <Unimun/>
                </div>
                به حساب کاربری شما ارسال می‌شود، ضروری است.


                این سند ممکن است دستخوش تغییرات و تجدیدنظر شود. لذا توصیه می‌شود که به منظور اطلاع از تغییرات این سند،
                برای هر بار ثبت آگهی این سند را مطالعه نمایید. تاریخ به‌روزرسانی این سند در انتها قید گردیده است.
                در صورتی که شما مایل نیستید اطلاعات شخصی شما در اختیار
                <div className={'w-12 inline-block mx-1 h-2'}>
                    <Unimun/>
                </div>
                قرار گیرد، لطفاً از ثبت آگهی در سایت و نرم‌افزار
                <div className={'w-12 inline-block mx-1 h-2'}>
                    <Unimun/>
                </div>
                خودداری نمایید.
                در مواردی که جمع‌آوری اطلاعات شخصی شما مطابق با قانون یا به منظور ارائه خدمات توسط
                <div className={'w-12 inline-block mx-1 h-2'}>
                    <Unimun/>
                </div>
                الزامی باشد، در صورت عدم ارائه اطلاعات مذکور،
                <div className={'w-12 inline-block mx-1 h-2'}>
                    <Unimun/>
                </div>
                قادر نخواهد بود خدمات مورد درخواست را ارائه نماید و ممکن است راساً نسبت به حذف آگهی شما و متعاقباً
                اطلاع‌رسانی به شما اقدام نماید.

                <h2 className={' block mt-7 mb-5 text-lg IranSansMedium text-center mx-4'}>
                    سایت و خدمات اشخاص ثالث

                </h2>
                آگهی‌های مندرج در سایت و نرم‌افزار
                <div className={'w-12 inline-block mx-1 h-2'}>
                    <Unimun/>
                </div>
                حاوی لینک‌های متعلق به اشخاص ثالث (اعم از آگهی‌دهندگان) است به نحوی که کلیک کردن روی آنها می‌تواند منجر
                به جمع‌آوری اطلاعات شخصی شما شود. توصیه
                <div className={'w-12 inline-block mx-1 h-2'}>
                    <Unimun/>
                </div>
                این است که علاوه بر این سند و تغییرات آن، سیاست‌های حفاظت از اطلاعات شخصی (Privacy Policy) (تحت همین نام
                یا نام‌های دیگر) لینک‌های متعلق به اشخاص ثالث را به دقت مطالعه کنید.
                <div className={'w-12 inline-block mx-1 h-2'}>
                    <Unimun/>
                </div>
                هیچ مسئولیتی در قبال اطلاعاتی که با اشخاص ثالث به اشتراک می‌گذارید نخواهد داشت. این امر در مورد مطالب
                اشخاص ثالث که در سایت یا نرم‌افزارها مشاهده می‌کنید و پیشنهادهایی که در رابطه با استفاده از محصولات و
                خدمات خود دارند، نیز صادق است.

                <br/>

                <h2 className={'mt-4 mb-3 text-lg IranSansMedium text-center px-7 '}>
                    کدام اطلاعات شخصی توسط
                    <div className={'w-16 inline-block mx-1 h-3'}>
                        <Unimun/>
                    </div>
                    جمع آوری می‌شوند

                </h2>

                مطابق با قانون تجارت الکترونیکی مصوب ۱۳۸۲ منظور از داده پیام شخصی (اطلاعات شخصی)، داده پیام‌های مربوط به
                یک شخص حقیقی مشخص و معین است.
                2-۱- اطلاعاتی که با نصب و/یا استفاده از نرم‌افزار
                <div className={'w-12 inline-block mx-1 h-2'}>
                    <Unimun/>
                </div>
                جمع‌آوری می‌شوند
                اطلاعات مربوط به استفاده از خدمات
                <div className={'w-12 inline-block mx-1 h-2'}>
                    <Unimun/>
                </div>
                و اطلاعات دستگاهی که نرم‌افزار
                <div className={'w-12 inline-block mx-1 h-2'}>
                    <Unimun/>
                </div>
                بر روی آن نصب شده‌است همزمان با نصب نرم‌افزار بر روی دستگاه شما (بدون ثبت آگهی) جمع‌آوری می‌شوند. برخی
                از این اطلاعات عبارتند از:
                2-۱-۱- نوع دستگاه، زبان و نوع سیستم عامل دستگاه شما،
                2-۱-۲- اطلاعاتی که شما با استفاده از نرم‌افزار مشاهده کرده‌اید،
                2-۱-۳- جست‌وجوهای انجام شده و نتایج انتخاب‌شده،
                2-۱-۴- مدت و باز‌ه‌های استفاده شما از خدمات
                <div className={'w-12 inline-block mx-1 h-2'}>
                    <Unimun/>
                </div>
                ،
                2-۱-۵-اطلاعات فنی و گزارش‌های سرورشامل آدرس پروتکل اینترنت (IP)، نوع شبکه، نوع و نسخه مرورگر، اطلاعات
                مهم دستگاه هنگام وقفه‌ها (Crashes) شامل وضعیت روت بودن یا نبودن دستگاه، میزان کل رم و میزان فضای پر آن
                هنگام وقفه، روز و ساعت رخدادها، خاموش یا روشن بودن شبکه بی‌سیم، خاموش یا روشن بودن شبکه دیتا، خاموش یا
                روشن بودن وضعیت رومینگ،
                2-۱-۶-شناسه اندروید و شناسه تبلیغاتی اندروید ویژه دستگاه شما،
                شناسه تبلیغاتی اندروید صرفاً به منظور تحلیل رفتار کاربر و نمایش تبلیغات یا پیشنهادات به صورت
                شخصی‌سازی‌شده، بدون اینکه به‌طور مستقیم به شخص حقیقی معین و مشخص مرتبط باشد، مورد استفاده قرار می‌گیرد.
                در صورت تغییر شناسه تبلیغاتی توسط کاربر، شناسه تبلیغاتی جدید به شناسه تبلیغاتی قبلی و اطلاعات مرتبط به
                آن، متصل نخواهد شد.
                2-۱-۷- ما ممکن است از کوکی‌ها (cookies) در جمع‌آوری اطلاعات استفاده کنیم. کوکی فایلی است که به درخواست
                یک سایت، توسط مرورگر ایجاد می‌شود و به سایت امکان ذخیره بازدید‌های شما و مناسب‌سازی آنها را فراهم
                می‌نماید. به عنوان مثال ما با استفاده از کوکی می‌توانیم محتوایی را به شما پیشنهاد بدهیم که متناسب با
                علاقه‌ها و ترجیحات شما باشد. بسیاری از مرورگرها امکان غیرفعال کردن کوکی را فراهم کرده‌اند، به این منظور
                می‌توانید راهنمای مرورگرها را مطالعه کنید. (برای مثال، Internet Explorer، Google Chrome، Mozilla Firefox
                و Apple Safari)

                این اطلاعات به نحوی مورد استفاده قرار می‌گیرند که به طور مستقیم به یک شخص حقیقی مشخص و معین مرتبط
                نباشند.

                2-۲- اطلاعات شخصی
                اطلاعات شخصی که توسط
                <div className={'w-12 inline-block mx-1 h-2'}>
                    <Unimun/>
                </div>
                جمع‌آوری می شوند شامل موارد ذیل است:
                2-۲-۱- اطلاعاتی که برای ثبت آگهی در
                <div className={'w-12 inline-block mx-1 h-2'}>
                    <Unimun/>
                </div>
                ضروری است شامل اطلاعات مربوط به هویت نظیر نام، نام خانوادگی، اطلاعات مربوط به روش های ارتباط با شما شامل
                شماره تماس (اعم از ثابت و موبایل)، نام کاربری شبکه های اجتماعی و غیره که شما در اختیار
                <div className={'w-12 inline-block mx-1 h-2'}>
                    <Unimun/>
                </div>
                قرار می‌دهید؛
                2-۲-۲- سوابق کلیه خریدها و آگهی‌ها در بستر
                <div className={'w-12 inline-block mx-1 h-2'}>
                    <Unimun/>
                </div>
                ؛
                2-۲-۳- فهرستی از آگهی های ثبت شده؛
                2-۲-۴- اطلاعات مربوط به مبادلات مالی نظیر کلیه پرداخت های موفق و ناموفق بابت ثبت آگهی در
                <div className={'w-12 inline-block mx-1 h-2'}>
                    <Unimun/>
                </div>
                ؛
                2-۲-۵- صدا و مکاتبات شما در تماس با تیم پشتیبانی ضبط می‌شود
                2-۲-۶- مکاتبات شما و سایر کاربران (در قالب چت) از طریق بستر
                <div className={'w-12 inline-block mx-1 h-2'}>
                    <Unimun/>
                </div>
                .


                <h2 className={'text-center IranSansMedium text-lg mt-6 my-3 mx-6'}>
                    <div className={'w-16 inline-block mx-1 h-3'}>
                        <Unimun/>
                    </div>
                    از اطلاعات شخصی چه استفاده‌ای می کند
                </h2>

                موارد عمده استفاده از اطلاعات عبارتند از:
                3-۱ استفاده از اطلاعات شخصی به منظور اجرای قرارداد فعلی یا آتی بین
                <div className={'w-12 inline-block mx-1 h-2'}>
                    <Unimun/>
                </div>
                و کاربر یا در مواردی که برای استیفای حقوق قانونی
                <div className={'w-12 inline-block mx-1 h-2'}>
                    <Unimun/>
                </div>
                ضروری باشد. به عبارت دیگر، از آنجا که
                <div className={'w-12 inline-block mx-1 h-2'}>
                    <Unimun/>
                </div>
                برای ارائه بهترین خدمات، با بیشترین امنیت برای کاربر و همچنین بهبود خدمات نیاز به استفاده از برخی
                اطلاعات دارد، با استفاده از اطلاعات کاربران ممکن است اقدامات ذیل را انجام دهد:
                ارزیابی عملکرد سایت و نرم‌افزار
                <div className={'w-12 inline-block mx-1 h-2'}>
                    <Unimun/>
                </div>
                و رفع اشکالات آن‌ها در نسخه‌های آتی،
                افزایش امنیت و صحت عملکرد سایت و نرم‌افزار،
                بهبود تجربۀ کاربری از طریق انطباق نرم‌افزار
                <div className={'w-12 inline-block mx-1 h-2'}>
                    <Unimun/>
                </div>
                با نیازها و شرایط کاربر و سیستم‌عامل‌های مورد استفاده در دستگاه‌های متنوع کاربران،
                تحلیل رفتار کاربران در استفاده از سایت و نرم‌افزار از جمله در مواجهه با نتایج جستجو و در نتیجه بهبود
                نتایج جست‌وجو با توجه به کلیدواژه‌های جستجو شده در میان کاربران،
                ارائه خدمات به نحوی که کاربر بتواند به نحوی کارآمد و منحصر به فرد، از کلیه امکانات موجود در سایت و
                برنامه استفاده کند به عنوان مثال بهبود نتایج جستجو و ارائه پیشنهاد‌های اختصاصی به کاربر،
                نمایش تاریخچه جستجوهای مشابه به کاربر در هنگام جستجو،
                انجام و تکمیل تراکنش و خرید درون‌برنامه‌ای،
                اطلاع‌رسانی رخدادهای مهم مانند به‌روزرسانی‌های خدمات و محصولات (برنامه‌های نصب شده)، تغییرات مهم در
                شرایط استفاده از
                <div className={'w-12 inline-block mx-1 h-2'}>
                    <Unimun/>
                </div>
                یا سیاست‌نامه حریم خصوصی،
                پیشنهاد آگهی و خدمات بر اساس موقعیت مکانی تقریبی کاربر، جست و جوهای کاربر و اولویت‌هایی که به
                <div className={'w-12 inline-block mx-1 h-2'}>
                    <Unimun/>
                </div>
                اعلام کرده است،
                آموزش تیم پشتیبانی برای پاسخگویی به کاربران و نظارت بر عملکرد آن‌ها،
                استفاده از اطلاعات برای طرح دعوا توسط
                <div className={'w-12 inline-block mx-1 h-2'}>
                    <Unimun/>
                </div>
                ، دفاع و پاسخگویی در برابر دعاوی مطروحه علیه
                <div className={'w-12 inline-block mx-1 h-2'}>
                    <Unimun/>
                </div>
                و هرگونه اقدام قضایی یا اداری مرتبط به منظور دفاع از حقوق و اموال
                <div className={'w-12 inline-block mx-1 h-2'}>
                    <Unimun/>
                </div>
                یا کاربران،
                حسب مورد استفاده از اطلاعات برای بازپرداخت وجوه به کاربران،
                انجام مکاتبات و تماس با کاربران توسط تیم پشتیبانی،
                توسعه و ارائه خدمات بهتر و بیشتر توسط
                <div className={'w-12 inline-block mx-1 h-2'}>
                    <Unimun/>
                </div>
                یا مجموعه شرکت‌های همکار و وابسته به
                <div className={'w-12 inline-block mx-1 h-2'}>
                    <Unimun/>
                </div>
                ،
                3-۲-
                <div className={'w-12 inline-block mx-1 h-2'}>
                    <Unimun/>
                </div>
                اطلاعات کاربران را برای ارائه‌ی گزارش‌های آماری از صنعت و کاربران، بدون اینکه به طور مستقیم به یک شخص
                حقیقی مشخص و معین مرتبط باشد، استفاده می‌کند.

            </div>

        </div>
    );
};

export default Rules;